tangyangguang/Esp32_Irrigation/src/domain/FlowCalibration.cpp
#include "domain/FlowCalibration.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <stdlib.h>
#include <string.h>

#include "domain/FlowMeter.h"
#include "domain/ValveController.h"
#include "domain/ZoneManager.h"
#include "storage/ZoneConfigStore.h"

namespace {

static constexpr uint32_t stableWindowMs = 2000UL;
static constexpr uint32_t stableStepMs = 200UL;
static constexpr uint8_t stableWindowStepCount = stableWindowMs / stableStepMs;
static constexpr uint8_t stableConsecutiveWindows = 5;
static constexpr uint8_t stableRateTolerancePercent = 10;
static constexpr uint32_t minStableStartMs = 1000UL;

FlowCalibration::State g_state = FlowCalibration::State::IDLE;
uint8_t g_activeZoneId = 0;
uint32_t g_startedMs = 0;
uint32_t g_startedPulseCount = 0;
uint32_t g_maxCaptureMs = 0;
uint8_t g_sampleCapacity = FlowCalibration::MaxSamples;
uint16_t* g_activeWindowPulses = nullptr;
uint16_t g_activeWindowCapacity = 0;
uint16_t g_activeWindowCount = 0;
uint32_t g_nextWindowSampleMs = 0;
uint32_t g_windowPulseHistory[stableWindowStepCount + 1] = {};
uint8_t g_windowPulseHistoryPos = 0;
uint8_t g_windowPulseHistoryFilled = 0;
FlowCalibration::Sample g_samples[FlowCalibration::MaxSamples] = {};
uint8_t g_sampleCount = 0;
FlowCalibration::Sample g_pending = {};
uint16_t g_pendingDeltas[FlowCalibration::MaxDetailPulses] = {};
FlowCalibration::Recommendation g_recommendation = {};
char g_lastError[32] = "";
FlowCalibration::Sample g_emptySample = {};

void setError(const char* error) {
    strlcpy(g_lastError, error ? error : "", sizeof(g_lastError));
}

uint16_t clampDetailPulseLimit(uint16_t value) {
    return value > FlowCalibration::MaxDetailPulses ? FlowCalibration::MaxDetailPulses : value;
}

bool sampleSlotAvailable() {
    return g_sampleCount < FlowCalibration::MaxSamples && g_sampleCount < g_sampleCapacity;
}

uint8_t clampSampleCapacity(uint8_t value) {
    if (value < 2) {
        return 2;
    }
    if (value > FlowCalibration::MaxSamples) {
        return FlowCalibration::MaxSamples;
    }
    return value;
}

void freeSampleData(FlowCalibration::Sample* sample) {
    if (!sample) {
        return;
    }
    if (sample->detailPulseDeltas) {
        free(sample->detailPulseDeltas);
    }
    if (sample->windowPulses) {
        free(sample->windowPulses);
    }
    *sample = {};
}

void releaseActiveWindow() {
    if (g_activeWindowPulses) {
        free(g_activeWindowPulses);
    }
    g_activeWindowPulses = nullptr;
    g_activeWindowCapacity = 0;
    g_activeWindowCount = 0;
    g_nextWindowSampleMs = 0;
    memset(g_windowPulseHistory, 0, sizeof(g_windowPulseHistory));
    g_windowPulseHistoryPos = 0;
    g_windowPulseHistoryFilled = 0;
}

bool beginWindowCapture(const Irrigation::SystemConfig& config) {
    releaseActiveWindow();
    const uint32_t points = (static_cast<uint32_t>(config.calibrationMaxCaptureMin) * 60000UL + stableStepMs - 1UL) / stableStepMs;
    if (points == 0 || points > 65535UL) {
        return false;
    }
    g_activeWindowPulses = static_cast<uint16_t*>(malloc(static_cast<size_t>(points) * sizeof(uint16_t)));
    if (!g_activeWindowPulses) {
        return false;
    }
    g_activeWindowCapacity = static_cast<uint16_t>(points);
    g_activeWindowCount = 0;
    g_nextWindowSampleMs = g_startedMs + stableStepMs;
    memset(g_windowPulseHistory, 0, sizeof(g_windowPulseHistory));
    g_windowPulseHistoryPos = 0;
    g_windowPulseHistoryFilled = 0;
    return true;
}

void recordWindowPoint(uint32_t cumulativePulses) {
    if (!g_activeWindowPulses || g_activeWindowCount >= g_activeWindowCapacity) {
        return;
    }
    uint32_t windowStartPulses = 0;
    if (g_windowPulseHistoryFilled >= stableWindowStepCount) {
        const uint8_t historyIndex = static_cast<uint8_t>((g_windowPulseHistoryPos + 1) % (stableWindowStepCount + 1));
        windowStartPulses = g_windowPulseHistory[historyIndex];
    }
    uint32_t windowPulses = cumulativePulses >= windowStartPulses ? cumulativePulses - windowStartPulses : 0;
    if (windowPulses > 65535UL) {
        windowPulses = 65535UL;
    }
    g_activeWindowPulses[g_activeWindowCount++] = static_cast<uint16_t>(windowPulses);
    g_windowPulseHistory[g_windowPulseHistoryPos] = cumulativePulses;
    g_windowPulseHistoryPos = static_cast<uint8_t>((g_windowPulseHistoryPos + 1) % (stableWindowStepCount + 1));
    if (g_windowPulseHistoryFilled < stableWindowStepCount + 1) {
        ++g_windowPulseHistoryFilled;
    }
}

void updateWindowCapture(uint32_t nowMs) {
    if (!g_activeWindowPulses || g_nextWindowSampleMs == 0) {
        return;
    }
    while (g_activeWindowCount < g_activeWindowCapacity &&
           static_cast<int32_t>(nowMs - g_nextWindowSampleMs) >= 0) {
        const uint32_t pulses = FlowMeter::pulseCount(g_activeZoneId);
        const uint32_t cumulative = pulses >= g_startedPulseCount ? pulses - g_startedPulseCount : 0;
        recordWindowPoint(cumulative);
        g_nextWindowSampleMs += stableStepMs;
    }
}

void shrinkActiveWindowForPending() {
    g_pending.windowPulses = g_activeWindowPulses;
    g_pending.windowPulseCount = g_activeWindowCount;
    if (g_pending.windowPulses && g_pending.windowPulseCount == 0) {
        free(g_pending.windowPulses);
        g_pending.windowPulses = nullptr;
    } else if (g_pending.windowPulses && g_pending.windowPulseCount < g_activeWindowCapacity) {
        void* shrunk = realloc(g_pending.windowPulses, static_cast<size_t>(g_pending.windowPulseCount) * sizeof(uint16_t));
        if (shrunk) {
            g_pending.windowPulses = static_cast<uint16_t*>(shrunk);
        }
    }
    g_activeWindowPulses = nullptr;
    g_activeWindowCapacity = 0;
    g_activeWindowCount = 0;
}

uint32_t pulseTimeAt(const uint16_t* deltas, uint16_t count, uint16_t index) {
    uint32_t t = 0;
    for (uint16_t i = 0; i <= index && i < count; ++i) {
        t += deltas[i];
    }
    return t;
}

uint16_t countPulsesBefore(const uint16_t* deltas, uint16_t count, uint32_t timeMs) {
    uint32_t t = 0;
    uint16_t pulses = 0;
    for (uint16_t i = 0; i < count; ++i) {
        t += deltas[i];
        if (t < timeMs) {
            ++pulses;
        }
    }
    return pulses;
}

uint16_t countPulsesInWindow(const uint16_t* deltas, uint16_t count, uint32_t startMs, uint32_t endMs) {
    uint32_t t = 0;
    uint16_t pulses = 0;
    for (uint16_t i = 0; i < count; ++i) {
        t += deltas[i];
        if (t >= startMs && t < endMs) {
            ++pulses;
        }
    }
    return pulses;
}

