tangyangguang/Esp32_Irrigation/src/domain/FlowCalibration.cpp
void analyzeStablePoint(FlowCalibration::Sample* sample) {
    if (!sample) {
        return;
    }
    sample->stableDetected = false;
    sample->stableStartMs = 0;
    sample->startupPulseInSample = 0;
    sample->stableRatePerMinuteX1000 = 0;
    sample->rateVariationPermille = 0;
    const uint16_t* deltas = sample->detailPulseDeltas;
    if (!deltas || sample->detailCapturedPulses < 2) {
        return;
    }
    const uint32_t lastPulseMs = pulseTimeAt(deltas, sample->detailCapturedPulses, sample->detailCapturedPulses - 1);
    const uint32_t requiredSpan = stableWindowMs + static_cast<uint32_t>(stableConsecutiveWindows - 1) * stableStepMs;
    if (lastPulseMs < minStableStartMs + requiredSpan) {
        return;
    }

    for (uint32_t startMs = minStableStartMs; startMs + requiredSpan <= lastPulseMs; startMs += stableStepMs) {
        uint16_t minRate = 65535;
        uint16_t maxRate = 0;
        uint32_t sum = 0;
        bool usable = true;
        for (uint8_t i = 0; i < stableConsecutiveWindows; ++i) {
            const uint32_t windowStart = startMs + static_cast<uint32_t>(i) * stableStepMs;
            const uint16_t pulses = countPulsesInWindow(deltas, sample->detailCapturedPulses, windowStart, windowStart + stableWindowMs);
            if (pulses == 0) {
                usable = false;
                break;
            }
            if (pulses < minRate) minRate = pulses;
            if (pulses > maxRate) maxRate = pulses;
            sum += pulses;
        }
        if (!usable || sum == 0) {
            continue;
        }
        const uint32_t spread = static_cast<uint32_t>(maxRate - minRate);
        if (spread * 100UL * stableConsecutiveWindows > sum * stableRateTolerancePercent) {
            continue;
        }
        sample->stableDetected = true;
        sample->stableStartMs = startMs;
        sample->startupPulseInSample = countPulsesBefore(deltas, sample->detailCapturedPulses, startMs);
        sample->stableRatePerMinuteX1000 = static_cast<uint32_t>((static_cast<uint64_t>(sum) * 60000ULL * 1000ULL) /
                                                                 (stableWindowMs * stableConsecutiveWindows));
        sample->rateVariationPermille = static_cast<uint16_t>((spread * 1000UL * stableConsecutiveWindows) / sum);
        return;
    }
}

uint32_t estimateMl(uint32_t pulses, uint16_t startupPulseLimit, uint16_t startupEstimatedMl, uint16_t stablePulsePerLiter) {
    if (stablePulsePerLiter == 0) {
        return 0;
    }
    if (startupPulseLimit == 0) {
        return static_cast<uint32_t>((static_cast<uint64_t>(pulses) * 1000ULL) / stablePulsePerLiter);
    }
    const uint32_t startupPulses = pulses < startupPulseLimit ? pulses : startupPulseLimit;
    const uint32_t stablePulses = pulses > startupPulseLimit ? pulses - startupPulseLimit : 0;
    const uint64_t startupMl = (static_cast<uint64_t>(startupPulses) * startupEstimatedMl) / startupPulseLimit;
    const uint64_t stableMl = (static_cast<uint64_t>(stablePulses) * 1000ULL) / stablePulsePerLiter;
    return static_cast<uint32_t>(startupMl + stableMl);
}

uint8_t collectValidSamples(const FlowCalibration::Sample** out) {
    uint8_t count = 0;
    for (uint8_t i = 0; i < g_sampleCount; ++i) {
        if (g_samples[i].exists && g_samples[i].valid && g_samples[i].actualMl > 0 && g_samples[i].totalPulses > 0) {
            out[count++] = &g_samples[i];
        }
    }
    return count;
}

void fillRecommendationDiagnostics(FlowCalibration::Recommendation* out, const FlowCalibration::Sample** samples, uint8_t sampleCount) {
    if (!out || !samples || sampleCount == 0) {
        return;
    }
    uint32_t minMl = samples[0]->actualMl;
    uint32_t maxMl = samples[0]->actualMl;
    uint32_t minPulses = samples[0]->totalPulses;
    uint32_t maxPulses = samples[0]->totalPulses;
    uint8_t stableCount = 0;
    for (uint8_t i = 0; i < sampleCount; ++i) {
        if (samples[i]->actualMl < minMl) minMl = samples[i]->actualMl;
        if (samples[i]->actualMl > maxMl) maxMl = samples[i]->actualMl;
        if (samples[i]->totalPulses < minPulses) minPulses = samples[i]->totalPulses;
        if (samples[i]->totalPulses > maxPulses) maxPulses = samples[i]->totalPulses;
        if (samples[i]->stableDetected) {
            ++stableCount;
        }
    }
    out->stableDetectedCount = stableCount;
    out->volumeSpanPermille = maxMl > 0 ? static_cast<uint16_t>(((maxMl - minMl) * 1000UL) / maxMl) : 0;
    out->pulseSpanPermille = maxPulses > 0 ? static_cast<uint16_t>(((maxPulses - minPulses) * 1000UL) / maxPulses) : 0;
}

uint16_t medianDetectedStartup() {
    uint16_t values[FlowCalibration::MaxSamples] = {};
    uint8_t count = 0;
    for (uint8_t i = 0; i < g_sampleCount; ++i) {
        if (g_samples[i].exists && g_samples[i].valid && g_samples[i].stableDetected) {
            values[count++] = g_samples[i].startupPulseInSample;
        }
    }
    if (count == 0) {
        return 0;
    }
    for (uint8_t i = 0; i < count; ++i) {
        for (uint8_t j = static_cast<uint8_t>(i + 1); j < count; ++j) {
            if (values[j] < values[i]) {
                const uint16_t tmp = values[i];
                values[i] = values[j];
                values[j] = tmp;
            }
        }
    }
    return values[count / 2];
}

bool scoreCandidate(uint16_t candidate,
                    const FlowCalibration::Sample** samples,
                    uint8_t sampleCount,
                    FlowCalibration::Recommendation* out) {
    double startupEstimatedMl = 0.0;
    double mlPerStablePulse = 0.0;
    if (sampleCount == 1) {
        const FlowCalibration::Sample* sample = samples[0];
        const double mlPerPulse = static_cast<double>(sample->actualMl) / static_cast<double>(sample->totalPulses);
        mlPerStablePulse = mlPerPulse;
        startupEstimatedMl = static_cast<double>(candidate) * mlPerPulse;
    } else if (candidate == 0) {
        double sx2 = 0.0;
        double sxy = 0.0;
        for (uint8_t i = 0; i < sampleCount; ++i) {
            const double x = static_cast<double>(samples[i]->totalPulses);
            sx2 += x * x;
            sxy += x * static_cast<double>(samples[i]->actualMl);
        }
        if (sx2 <= 0.0) {
            return false;
        }
        mlPerStablePulse = sxy / sx2;
    } else {
        double s11 = 0.0;
        double s12 = 0.0;
        double s22 = 0.0;
        double sy1 = 0.0;
        double sy2 = 0.0;
        for (uint8_t i = 0; i < sampleCount; ++i) {
            const double x1 = static_cast<double>(samples[i]->totalPulses < candidate ? samples[i]->totalPulses : candidate) /
                              static_cast<double>(candidate);
            const double x2 = samples[i]->totalPulses > candidate ? static_cast<double>(samples[i]->totalPulses - candidate) : 0.0;
            const double y = static_cast<double>(samples[i]->actualMl);
            s11 += x1 * x1;
            s12 += x1 * x2;
            s22 += x2 * x2;
            sy1 += x1 * y;
            sy2 += x2 * y;
        }
        const double det = s11 * s22 - s12 * s12;
        if (det <= 0.000001) {
            return false;
        }
        startupEstimatedMl = (sy1 * s22 - sy2 * s12) / det;
        mlPerStablePulse = (s11 * sy2 - s12 * sy1) / det;
    }

