tangyangguang/Esp32_Irrigation/src/domain/FlowCalibration.cpp
    if (startupEstimatedMl < 0.0 || mlPerStablePulse <= 0.0) {
        return false;
    }
    const uint16_t startupMl = static_cast<uint16_t>(startupEstimatedMl > 10000.0 ? 10000 : startupEstimatedMl + 0.5);
    const double stablePplRaw = 1000.0 / mlPerStablePulse;
    const uint16_t stablePpl = static_cast<uint16_t>(stablePplRaw < 1.0 ? 1 : (stablePplRaw > 10000.0 ? 10000 : stablePplRaw + 0.5));

    out->valid = true;
    out->flow.startupPulseLimit = candidate;
    out->flow.startupEstimatedMl = candidate == 0 ? 0 : startupMl;
    out->flow.stablePulsePerLiter = stablePpl;
    out->sampleCount = sampleCount;
    uint32_t sumErrorPermille = 0;
    uint16_t maxErrorPermille = 0;
    for (uint8_t i = 0; i < sampleCount; ++i) {
        const uint32_t estimated = estimateMl(samples[i]->totalPulses,
                                              out->flow.startupPulseLimit,
                                              out->flow.startupEstimatedMl,
                                              out->flow.stablePulsePerLiter);
        const int32_t errorMl = static_cast<int32_t>(estimated) - static_cast<int32_t>(samples[i]->actualMl);
        const uint32_t absError = errorMl < 0 ? static_cast<uint32_t>(-errorMl) : static_cast<uint32_t>(errorMl);
        const uint16_t errorPermille = static_cast<uint16_t>((absError * 1000UL) / samples[i]->actualMl);
        out->errors[i].sampleIndex = i;
        out->errors[i].actualMl = samples[i]->actualMl;
        out->errors[i].estimatedMl = estimated;
        out->errors[i].errorMl = errorMl;
        out->errors[i].errorPermille = errorPermille;
        sumErrorPermille += errorPermille;
        if (errorPermille > maxErrorPermille) {
            maxErrorPermille = errorPermille;
        }
    }
    out->averageErrorPermille = static_cast<uint16_t>(sumErrorPermille / sampleCount);
    out->maxErrorPermille = maxErrorPermille;
    fillRecommendationDiagnostics(out, samples, sampleCount);
    return true;
}

void finishCapture(bool validStop, const char* invalidReason) {
    FlowMeter::CaptureResult capture = {};
    (void)ValveController::off(g_activeZoneId, "flow calibration finish");
    updateWindowCapture(millis());
    if (!FlowMeter::endCapture(g_pendingDeltas, FlowCalibration::MaxDetailPulses, &capture)) {
        setError("capture_end_failed");
        g_state = FlowCalibration::State::IDLE;
        releaseActiveWindow();
        return;
    }
    freeSampleData(&g_pending);
    g_pending.exists = true;
    g_pending.valid = validStop;
    g_pending.zoneId = g_activeZoneId;
    g_pending.startedMs = g_startedMs;
    g_pending.endedMs = millis();
    g_pending.durationMs = g_pending.endedMs - g_startedMs;
    const uint32_t endedPulseCount = FlowMeter::pulseCount(g_activeZoneId);
    g_pending.totalPulses = endedPulseCount >= g_startedPulseCount ? endedPulseCount - g_startedPulseCount : 0;
    g_pending.detailCapturedPulses = capture.capturedPulses;
    strlcpy(g_pending.detailCaptureEndedReason, capture.endedReason, sizeof(g_pending.detailCaptureEndedReason));
    if (g_pending.detailCapturedPulses > 0) {
        g_pending.detailPulseDeltas = static_cast<uint16_t*>(malloc(static_cast<size_t>(g_pending.detailCapturedPulses) * sizeof(uint16_t)));
        if (!g_pending.detailPulseDeltas) {
            freeSampleData(&g_pending);
            releaseActiveWindow();
            setError("memory_low");
            g_state = FlowCalibration::State::IDLE;
            return;
        }
        memcpy(g_pending.detailPulseDeltas, g_pendingDeltas, static_cast<size_t>(g_pending.detailCapturedPulses) * sizeof(uint16_t));
    }
    shrinkActiveWindowForPending();
    if (!validStop) {
        strlcpy(g_pending.invalidReason, invalidReason ? invalidReason : "invalid_stop", sizeof(g_pending.invalidReason));
        if (sampleSlotAvailable()) {
            freeSampleData(&g_samples[g_sampleCount]);
            g_samples[g_sampleCount] = g_pending;
            g_pending = {};
            ++g_sampleCount;
        } else {
            freeSampleData(&g_pending);
        }
        g_state = FlowCalibration::State::IDLE;
    } else {
        g_state = FlowCalibration::State::WAITING_ACTUAL;
    }
}

}

namespace FlowCalibration {

void begin() {
    clear();
}

void handle(const Irrigation::SystemConfig& config) {
    if (g_state != State::CAPTURING) {
        return;
    }
    const uint32_t now = millis();
    updateWindowCapture(now);
    if (now - g_startedMs >= static_cast<uint32_t>(config.calibrationMaxCaptureMin) * 60000UL) {
        finishCapture(false, "capture_timeout");
    }
}

bool active() {
    return g_state == State::CAPTURING || g_state == State::WAITING_ACTUAL;
}

State state() {
    return g_state;
}

uint8_t activeZoneId() {
    return g_activeZoneId;
}

const char* lastError() {
    return g_lastError;
}

bool start(uint8_t zoneId, const Irrigation::SystemConfig& config) {
    if (g_state != State::IDLE) {
        setError("calibration_busy");
        return false;
    }
    if (!Irrigation::validZoneId(zoneId) || !ZoneConfigStore::get(zoneId).enabled) {
        setError("invalid_zone");
        return false;
    }
    if (ZoneManager::isBusy() || ZoneManager::leakAlertActive()) {
        setError("zone_busy");
        return false;
    }
    g_sampleCapacity = clampSampleCapacity(config.calibrationSampleTarget);
    if (!sampleSlotAvailable()) {
        setError("sample_full");
        return false;
    }
    const uint16_t detailLimit = clampDetailPulseLimit(config.calibrationDetailPulseLimit);
    g_activeZoneId = zoneId;
    g_startedMs = millis();
    g_startedPulseCount = FlowMeter::pulseCount(zoneId);
    g_maxCaptureMs = static_cast<uint32_t>(config.calibrationMaxCaptureMin) * 60000UL;
    if (!beginWindowCapture(config)) {
        setError("memory_low");
        return false;
    }
    if (!FlowMeter::beginCapture(zoneId, static_cast<uint32_t>(config.calibrationDetailCaptureSec) * 1000UL, detailLimit)) {
        releaseActiveWindow();
        setError("capture_start_failed");
        return false;
    }
    if (!ValveController::setRoad(zoneId, true, "flow calibration start")) {
        FlowMeter::CaptureResult ignored = {};
        (void)FlowMeter::endCapture(g_pendingDeltas, FlowCalibration::MaxDetailPulses, &ignored);
        releaseActiveWindow();
        setError("valve_start_failed");
        return false;
    }
    g_state = State::CAPTURING;
    setError("");
    return true;
}

bool stop() {
    if (g_state != State::CAPTURING) {
        setError("not_capturing");
        return false;
    }
    finishCapture(true, nullptr);
    return g_state == State::WAITING_ACTUAL;
}

bool submitActualMilliliters(uint32_t actualMl) {
    if (g_state != State::WAITING_ACTUAL) {
        setError("not_waiting_actual");
        return false;
    }
    if (actualMl == 0 || g_sampleCount >= FlowCalibration::MaxSamples) {
        setError("invalid_actual_ml");
        return false;
    }
    g_pending.actualMl = actualMl;
    g_pending.valid = g_pending.totalPulses > 0;
    if (!g_pending.valid) {
        strlcpy(g_pending.invalidReason, "no_pulses", sizeof(g_pending.invalidReason));
    } else {
        analyzeStablePoint(&g_pending);
    }
    freeSampleData(&g_samples[g_sampleCount]);
    g_samples[g_sampleCount] = g_pending;
    ++g_sampleCount;
    g_recommendation = {};
    g_pending = {};
    g_state = State::IDLE;
    setError("");
    return true;
}

bool updateActualMilliliters(uint8_t sampleIndex, uint32_t actualMl) {
    if (sampleIndex >= g_sampleCount || actualMl == 0) {
        setError("invalid_actual_ml");
        return false;
    }
    Sample& target = g_samples[sampleIndex];
    if (!target.exists || target.totalPulses == 0) {
        setError("invalid_sample");
        return false;
    }
    target.actualMl = actualMl;
    target.valid = true;
    target.invalidReason[0] = '\0';
    analyzeStablePoint(&target);
    g_recommendation = {};
    setError("");
    return true;
}

bool clear() {
    (void)ValveController::off(g_activeZoneId, "flow calibration clear");
    if (g_state == State::CAPTURING) {
        FlowMeter::CaptureResult ignored = {};
        (void)FlowMeter::endCapture(g_pendingDeltas, FlowCalibration::MaxDetailPulses, &ignored);
    }
    for (uint8_t i = 0; i < FlowCalibration::MaxSamples; ++i) {
        freeSampleData(&g_samples[i]);
    }
    freeSampleData(&g_pending);
    releaseActiveWindow();
    g_state = State::IDLE;
    g_activeZoneId = 0;
    g_startedMs = 0;
    g_startedPulseCount = 0;
    g_maxCaptureMs = 0;
    memset(g_pendingDeltas, 0, sizeof(g_pendingDeltas));
    g_recommendation = {};
    g_sampleCount = 0;
    setError("");
    return true;
}

