tangyangguang/Esp32_Irrigation/src/domain/FlowCalibration.cpp
uint8_t sampleCount() {
    return g_sampleCount;
}

uint8_t validSampleCount() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < g_sampleCount; ++i) {
        if (g_samples[i].valid) {
            ++count;
        }
    }
    return count;
}

const Sample& sample(uint8_t index) {
    if (index >= g_sampleCount) {
        return g_emptySample;
    }
    return g_samples[index];
}

uint16_t samplePulseDelta(uint8_t sampleIndex, uint16_t pulseIndex) {
    if (sampleIndex >= g_sampleCount || pulseIndex >= g_samples[sampleIndex].detailCapturedPulses || !g_samples[sampleIndex].detailPulseDeltas) {
        return 0;
    }
    return g_samples[sampleIndex].detailPulseDeltas[pulseIndex];
}

uint16_t sampleWindowPulse(uint8_t sampleIndex, uint16_t pointIndex) {
    if (sampleIndex >= g_sampleCount || pointIndex >= g_samples[sampleIndex].windowPulseCount || !g_samples[sampleIndex].windowPulses) {
        return 0;
    }
    return g_samples[sampleIndex].windowPulses[pointIndex];
}

bool computeRecommendation(Recommendation* out) {
    const Sample* samples[MaxSamples] = {};
    const uint8_t validCount = collectValidSamples(samples);
    if (validCount == 0) {
        setError("no_valid_samples");
        return false;
    }
    Recommendation best = {};
    double bestScore = 999999999.0;
    const uint16_t median = medianDetectedStartup();
    uint16_t beginCandidate = 0;
    uint16_t endCandidate = 0;
    if (median > 0) {
        beginCandidate = static_cast<uint16_t>((static_cast<uint32_t>(median) * 70UL) / 100UL);
        endCandidate = static_cast<uint16_t>((static_cast<uint32_t>(median) * 130UL) / 100UL);
        if (endCandidate <= beginCandidate) {
            endCandidate = static_cast<uint16_t>(beginCandidate + 1);
        }
    }
    for (uint16_t candidate = beginCandidate; candidate <= endCandidate; ++candidate) {
        Recommendation current = {};
        if (!scoreCandidate(candidate, samples, validCount, &current)) {
            continue;
        }
        double score = static_cast<double>(current.averageErrorPermille) + static_cast<double>(current.maxErrorPermille) * 0.25;
        if (!best.valid || score < bestScore) {
            best = current;
            bestScore = score;
        }
        if (candidate == 65535) {
            break;
        }
    }
    if (!best.valid) {
        setError("fit_failed");
        return false;
    }
    best.zoneId = samples[0]->zoneId;
    g_recommendation = best;
    if (out) {
        *out = g_recommendation;
    }
    setError("");
    return true;
}

const Recommendation& recommendation() {
    return g_recommendation;
}

bool applyRecommendation() {
    if (!g_recommendation.valid || !Irrigation::validZoneId(g_recommendation.zoneId)) {
        setError("no_recommendation");
        return false;
    }
    Irrigation::ZoneConfig config = ZoneConfigStore::get(g_recommendation.zoneId);
    config.flow.startupPulseLimit = g_recommendation.flow.startupPulseLimit;
    config.flow.startupEstimatedMl = g_recommendation.flow.startupEstimatedMl;
    config.flow.stablePulsePerLiter = g_recommendation.flow.stablePulsePerLiter;
    if (!ZoneConfigStore::set(g_recommendation.zoneId, config)) {
        setError("save_failed");
        return false;
    }
    (void)ZoneManager::reloadZone(g_recommendation.zoneId);
    setError("");
    return true;
}

}
